In [1]:
import pandas as pd

# 1. Intro to the Working with Text Data Module

In [10]:
chicago = pd.read_csv('chicago.csv')
chicago['Department'] = chicago['Department'].astype('category')
chicago['Position Title'] = chicago['Position Title'].astype('category')
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [7]:
chicago['Position Title'].nunique()

1093

In [5]:
chicago['Department'].nunique()

35

In [11]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null category
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(2), object(2)
memory usage: 645.1+ KB

# 2. Common String Methods - lower, upper, title, and len

In [13]:
chicago = pd.read_csv('chicago.csv')
chicago['Position Title'] = chicago['Position Title'].astype('category')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [14]:
chicago['Name'].str.lower().head(3)

0      aaron,  elvia j
1    aaron,  jeffery m
2       aaron,  karina
Name: Name, dtype: object

In [15]:
chicago['Name'].str.upper().head(3)

0      AARON,  ELVIA J
1    AARON,  JEFFERY M
2       AARON,  KARINA
Name: Name, dtype: object

In [16]:
chicago['Name'].str.title().head(3)

0      Aaron,  Elvia J
1    Aaron,  Jeffery M
2       Aaron,  Karina
Name: Name, dtype: object

In [17]:
chicago['Name'].str.len().head(3)

0    15.0
1    17.0
2    14.0
Name: Name, dtype: float64

In [18]:
len(chicago['Name'])

32063

In [19]:
chicago['Name'] = chicago['Name'].str.title()
chicago['Position Title'] = chicago['Position Title'].str.title()
chicago['Department'] = chicago['Department'].str.title()
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    Aaron,  Elvia J  Water Rate Taker  Water Mgmnt              $90744.00
1  Aaron,  Jeffery M    Police Officer       Police              $84450.00
2     Aaron,  Karina    Police Officer       Police              $84450.00

# 3. The .str.replace() Method

In [20]:
chicago = pd.read_csv('chicago.csv')
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [21]:
chicago1 = pd.read_csv('chicago.csv').dropna(how = 'all')
chicago1['Position Title'] = chicago1['Position Title'].astype('category')
chicago1['Department'] = chicago1['Department'].astype('category')
chicago1.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [22]:
chicago1['Department'].head(3)

0    WATER MGMNT
1         POLICE
2         POLICE
Name: Department, dtype: category
Categories (35, object): [ADMIN HEARNG, ANIMAL CONTRL, AVIATION, BOARD OF ELECTION, ..., STREETS & SAN, TRANSPORTN, TREASURER, WATER MGMNT]

In [23]:
chicago1['Department'] = chicago1['Department'].str.replace('MGMNT','MANAGEMENT')

In [24]:
chicago1.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MANAGEMENT,$106836.00

In [26]:
chicago1['Employee Annual Salary'] = chicago1['Employee Annual Salary'].str.replace('$','').astype('float')

In [27]:
chicago1.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,84450.0
2,"AARON, KARINA",POLICE OFFICER,POLICE,84450.0
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,89880.0
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MANAGEMENT,106836.0

In [28]:
chicago1['Employee Annual Salary'].mean()

80204.178633899

In [29]:
chicago1['Employee Annual Salary'].std()

25098.329867510587

In [30]:
chicago1['Employee Annual Salary'].nlargest(n = 5)

8184     300000.0
7954     216210.0
25532    202728.0
8924     197736.0
8042     197724.0
Name: Employee Annual Salary, dtype: float64

# 4. Filtering with String Methods

In [33]:
chicago = pd.read_csv('chicago.csv').dropna(how = 'all')
chicago['Position Title'] = chicago['Position Title'].astype('category')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [38]:
# Extracting Postion Title contains water
mask = chicago['Position Title'].str.lower().str.contains('water')
chicago[mask].head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,$82044.00
685,"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MGMNT,$109272.00
702,"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00

In [44]:
# Extracting position title starts with water

chicago[chicago['Position Title'].str.lower().str.startswith('water')].head()

                    Name    Position Title   Department Employee Annual Salary
0        AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
671      ANDER,  PERRY A  WATER CHEMIST II  WATER MGMNT              $82044.00
1054    ASHLEY,  KARMA T  WATER CHEMIST II  WATER MGMNT              $82044.00
1079   ATKINS,  JOANNA M  WATER CHEMIST II  WATER MGMNT              $82044.00
1181  AZEEM,  MOHAMMED A  WATER CHEMIST II  WATER MGMNT              $53172.00

In [47]:
# Extracting position title ends with ist

chicago[chicago['Position Title'].str.lower().str.endswith('ist')].head()

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",PSYCHIATRIST,HEALTH,$99840.00
308,"ALARCON, LUIS J",LOAN PROCESSING SPECIALIST,COMMUNITY DEVELOPMENT,$81948.00
422,"ALLAIN, CAROLYN",SENIOR TELECOMMUNICATIONS SPECIALIST,DoIT,$89880.00
472,"ALLEN, ROBERT",MACHINIST,WATER MGMNT,$94328.00
705,"ANDERSON, EDWARD M",SR PROCUREMENT SPECIALIST,PROCUREMENT,$91476.00

# 5. More String Methods - strip, lstrip, and rstrip

In [48]:
chicago = pd.read_csv('chicago.csv').dropna(how = 'all')
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [49]:
'     hello world    '.lstrip() # removes left spaces

'hello world    '

In [50]:
'     hello world    '.rstrip() # removes right spaces

'     hello world'

In [51]:
'     hello world    '.strip() # removes spaces from both the ends

'hello world'

In [53]:
chicago['Name'] = chicago['Name'].str.strip()

In [54]:
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [55]:
chicago['Postion Title'] = chicago['Position Title'].str.strip()
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary,Postion Title
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,WATER RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,POLICE OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,POLICE OFFICER

# 6. String Methods on Index and Columns

In [56]:
chicago = pd.read_csv('chicago.csv',index_col = 'Name').dropna(how = 'all')
chicago['Position Title'] = chicago['Position Title'].astype('category')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head(3)

                     Position Title   Department Employee Annual Salary
Name
AARON,  ELVIA J    WATER RATE TAKER  WATER MGMNT              $90744.00
AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
AARON,  KARINA       POLICE OFFICER       POLICE              $84450.00

In [59]:
# converting index values to title case\

chicago.index = chicago.index.str.title()

In [60]:
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [63]:
# converting columns values to upper case

chicago.columns = chicago.columns.str.upper()

In [64]:
chicago.head(3)

                     POSITION TITLE   DEPARTMENT EMPLOYEE ANNUAL SALARY
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

# 7. Split Strings by Characters with .str.split() Method

In [65]:
chicago = pd.read_csv('chicago.csv').dropna(how = 'all')
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [66]:
'hello my name is ambati'.split(' ') # splits based on white space

['hello', 'my', 'name', 'is', 'ambati']

In [71]:
chicago['First Name'] = chicago['Name'].str.split(',').str.get(0).str.title()

In [79]:
chicago['Middle Name'] = chicago['Name'].str.split(',').str.get(1).str.split().str.get(0).str.title()

In [88]:
chicago['Last Name'] = chicago['Name'].str.split(',').str.get(1).str.split().str.get(1)

In [89]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Middle Name,Last Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,Aaron,Elvia,J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,Aaron,Jeffery,M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,Aaron,Karina,NaN
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,Aaron,Kimberlei,R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,Abad Jr,Vicente,M

# 8. More Practice with Splits

In [98]:
chicago['Name'].str.split(',').str.get(1).str.split().str.get(0).str.title().value_counts().head(3)

Michael    1153
John        899
James       676
Name: Name, dtype: int64

# 9. The expand and n Parameters of the .str.split() Method

In [99]:
chicago = pd.read_csv('chicago.csv').dropna(how = 'all')
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [105]:
chicago[['First Name', 'Last Name']] = chicago['Name'].str.split(',', expand = True, n = 1) # here expand = True creates 
                                                                                            # a separate dataframe based on ','
                                                                                            # n = 1 is how many spaces to split

                    0              1
0               AARON        ELVIA J
1               AARON      JEFFERY M
2               AARON         KARINA
3               AARON    KIMBERLEI R
4             ABAD JR      VICENTE M
5              ABARCA         ANABEL
6              ABARCA       EMMANUEL
7             ABASCAL        REECE E
8              ABBASI    CHRISTOPHER
9          ABBATACOLA       ROBERT J
10        ABBATEMARCO        JAMES J
11             ABBATE        TERRY M
12             ABBOTT        BETTY L
13             ABBOTT       LYNISE M
14         ABBRUZZESE      WILLIAM J
15           ABDALLAH           ZAID
16          ABDELHADI      ABDALMAHD
17         ABDELLATIF         AREF R
18        ABDELMAJEID           AZIZ
19      ABDOLLAHZADEH            ALI
20        ABDUL-KARIM     MUHAMMAD A
21           ABDULLAH       DANIEL N
22           ABDULLAH          KEVIN
23           ABDULLAH      LAKENYA N
24           ABDULLAH       RASHAD J
25        ABDULSATTAR         MUDHAR
26       ABDUL-SHAKUR          TAHIR
27         ABDULWAHAB      ABUUBAIDA
28            ABEJERO        JASON V
29     ABERCROMBIE IV         EARL S
...               ...            ...
32032       ZUNIGA JR          JAMES
32033          ZUNIGA         JUAN M
32034          ZUNIGA          OSCAR
32035          ZUNIGA         RONALD
32036          ZUNIGA         THOMAS
32037          ZUNIGA        VICENTE
32038            ZUNO           ERIK
32039           ZUPAN         BILL M
32040        ZUPANCIC          KELLY
32041        ZURAWSKI        CAROL A
32042        ZURAWSKI        JEFFREY
32043        ZURAWSKI          MAC Z
32044        ZURAWSKI         MARY E
32045           ZUREK        FRANCIS
32046           ZUREK         MARY H
32047          ZURITA         ADRIEL
32048          ZVANJA         TINA M
32049    ZWARYCZ MANN        IRENE A
32050         ZWARYCZ       THOMAS J
32051        ZWIESLER        MATTHEW
32052            ZWIT      JEFFREY J
32053         ZWOLFER      MATTHEW W
32054            ZYCH        MATEUSZ
32055           ZYDEK          BRYAN
32056         ZYGADLO         JOHN P
32057         ZYGADLO      MICHAEL J
32058        ZYGOWICZ        PETER J
32059        ZYMANTAS         MARK E
32060       ZYRKOWSKI        CARLO E
32061       ZYSKOWSKI        DARIUSZ

[32062 rows x 2 columns]

In [114]:
chicago['Position Title'].str.split(' ', expand = True).head()

        0         1          2     3     4     5     6     7     8
0   WATER      RATE      TAKER  None  None  None  None  None  None
1  POLICE   OFFICER       None  None  None  None  None  None  None
2  POLICE   OFFICER       None  None  None  None  None  None  None
3   CHIEF  CONTRACT  EXPEDITER  None  None  None  None  None  None
4   CIVIL  ENGINEER         IV  None  None  None  None  None  None

In [117]:
chicago[['Column1', 'Column2']] = chicago['Position Title'].str.split(' ', expand = True, n = 1)

In [118]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,Column1,Column2
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,WATER,RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,POLICE,OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,POLICE,OFFICER
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,CHIEF,CONTRACT EXPEDITER
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,CIVIL,ENGINEER IV